In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.5.3'

# 3.1.2 Introduction to concat()

Combining data sets with concat()

In [4]:
# Create a DataFrame for the car models.
# Import Pandas.
import pandas as pd

# Create the DataFrame.
cars = pd.DataFrame({'VW': ['Polo', 'T-Cross', 'Tiguan', 'Toureg'],
                     'Toyota': ['Agya', 'Corolla', 'Rav4', 'Land Cruiser'],
                     'Honda': ['Brio', 'Jazz', 'HRV', 'CRV'], 
                     'BMW': ['BMW1', 'BMW2', 'BMW3', 'BMW4']}, 
                    index=[0, 1, 2, 3])

# View the DataFrame.
cars

        VW        Toyota Honda   BMW
0     Polo          Agya  Brio  BMW1
1  T-Cross       Corolla  Jazz  BMW2
2   Tiguan          Rav4   HRV  BMW3
3   Toureg  Land Cruiser   CRV  BMW4

In [6]:
# Create the motorcycle models DataFrame

motorcycles = pd.DataFrame({'VW': ['-', '-','-', '-'],
                           'Toyota': ['-', '-', '-', '-'],
                            'Honda': ['Shine', 'Activa', 'Comfort Travel',
                                      'Adventure Sport'],
                            'BMW': ['Sport', 'Roadster', 'Heritage', 'Adventure']},
                           index=[4, 5, 6, 7])

# View the DataFrame.
motorcycles

  VW Toyota            Honda        BMW
4  -      -            Shine      Sport
5  -      -           Activa   Roadster
6  -      -   Comfort Travel   Heritage
7  -      -  Adventure Sport  Adventure

# Concatenate the two DataFrames

What if you want to change the index of each DataFrame to distinguish between the two data sets? For example, the index of the cars DataFrame can be car1, car2, car3, and car4. The index for the motorcycles DataFrame can be mcycle1, mcycle2, mcycle3, and mcycle4. How would you write the code snippet?

Follow these prompts:

Create the two separate DataFrames with the new indexes as indicated previously. 
Name the new DataFrames cars_2 and motorcycles_2 respectively.
Use the same code snippet as before and combine the two DataFrames with the concat() function.
Name the new concatenated DataFrame products_2.

In [7]:
# Create cars_2 DataFrame.
cars_2 = pd.DataFrame({'VW': ['Polo', 'T-Cross', 'Tiguan', 'Toureg'],
                       'Toyota': ['Agya', 'Corolla', 'Rav4', 'Land Cruiser'],
                       'Honda': ['Brio', 'Jazz', 'HRV', 'CRV'], 
                       'BMW': ['BMW1', 'BMW2', 'BMW3', 'BMW4']},
                     index=['car1', 'car2', 'car3', 'car4'])


# Create motorcycles_2 DataFrame.
motorcycles_2 = pd.DataFrame({'VW': ['-', '-', '-', '-'],
                              'Toyota': ['-', '-', '-', '-'],
                              'Honda': ['Shine', 'Activa', 'Comfort Travel', 
                                        'Adventure Sport'],
                              'BMW': ['Sport', 'Roadster', 'Heritage', 'Adventure']},
                            index=['mcycle1', 'mcycle2', 'mcycle3', 'mcycle4'])


# Concatenate the two DataFrames.
products_2 = pd.concat([cars_2, motorcycles_2])

# View the DataFrame.
products_2

              VW        Toyota            Honda        BMW
car1        Polo          Agya             Brio       BMW1
car2     T-Cross       Corolla             Jazz       BMW2
car3      Tiguan          Rav4              HRV       BMW3
car4      Toureg  Land Cruiser              CRV       BMW4
mcycle1        -             -            Shine      Sport
mcycle2        -             -           Activa   Roadster
mcycle3        -             -   Comfort Travel   Heritage
mcycle4        -             -  Adventure Sport  Adventure

# Demonstration of the concat() function

In [4]:
# Import Pandas. 
import pandas as pd

# Read the CSV file.
classlist_a = pd.read_csv('classlist_a.csv')
classlist_b = pd.read_csv('classlist_b.csv')
classlist_c = pd.read_csv('classlist_c.csv')
classlist_d = pd.read_csv('classlist_d.csv')

# Determine shape of classlist.
print(classlist_a.shape)
classlist_a.head()

(145, 5)

   Student number    Surname Initials  Final mark Class
0        15476227     AFONSO        L       47.72     E
1        15311279   ALBERTYN    F J H       57.52     A
2        15637913  ALEXANDER        L       90.68     E
3        15124150        BAM      A J       56.43     E
4        15829626     BARROW      S B       79.64     E

In [11]:
print(classlist_b.shape)
classlist_b.head()

(126, 5)

   Student number Surname Initials  Final mark Class
0        16138201  ATWOOD       BJ       73.27     E
1        16007530  BASSON       WC       44.18     E
2        16764773   BESSA       LW       49.10     E
3        15991733  BESTER        C       67.44     A
4        16127447    BLOM       PJ       42.52     A

In [12]:
print(classlist_c.shape)
classlist_c.head()

(185, 5)

   Student number     Surname    Initials  Final mark Class
0        15849376   ADENDORFF  K                76.50     E
1        15805751    AUDITORE  L                64.25     E
2        16160045       BAARD  JC               51.25     E
3        16488547  BADENHORST  MJ               68.00     A
4        16586263      BASSON  J                57.75     A

In [13]:
print(classlist_d.shape)
classlist_d.head()

(219, 5)

,Student number,Surname,Initials,Final mark,Class
0,15793648,ABRAHAMS,B,48,E
1,17483638,ACKERMANN,E,45,E
2,16564499,ALBERTUS,S,57,E
3,17176654,ALWARD,F,0,A
4,17006414,ANDERSEN,M,28,A

In [16]:
# Concatenate class list a and b as ab

"""To combine classlist_a and classlist_b with the concat() function, prepare the code snippet as follows:

Create a new DataFrame with the name classlist_ab.
Use the pd.concat() function.
Specify the two-class lists to be combined as classlist_a and classlist_b.
Pass the shape parameter to determine the shape of the data set."""

# Concat class lists a and b

classlist_ab = pd.concat([classlist_a, classlist_b])

# View the DataFrame. 
print((classlist_ab.shape))
classlist_ab

(271, 5)

     Student number    Surname Initials  Final mark Class
0          15476227     AFONSO        L       47.72     E
1          15311279   ALBERTYN    F J H       57.52     A
2          15637913  ALEXANDER        L       90.68     E
3          15124150        BAM      A J       56.43     E
4          15829626     BARROW      S B       79.64     E
..              ...        ...      ...         ...   ...
121        16037804    VIVIERS       SF       59.31     A
122        16239369    WATKINS       TL       76.71     A
123        16070356  WILKINSON       GN       62.04     E
124        16083814       WISE       EA       71.82     E
125        16324773      ZONDI       WP       74.46     A

[271 rows x 5 columns]

In [17]:
# Concatenate class list c and d as cd

classlist_cd = pd.concat([classlist_c, classlist_d])

print((classlist_cd.shape))
classlist_cd

(404, 5)

,Student number,Surname,Initials,Final mark,Class
0,15849376,ADENDORFF,K,76.50,E
1,15805751,AUDITORE,L,64.25,E
2,16160045,BAARD,JC,51.25,E
3,16488547,BADENHORST,MJ,68.00,A
4,16586263,BASSON,J,57.75,A
...,...,...,...,...,...
214,16443144,WIJERS,MC,93.00,E
215,14955849,WIJNBERG,JM,47.00,E
216,17140293,WILLIAMS,CA,43.00,A
217,16771354,WOLHUTER,J,76.00,E
218,17094607,ZINN,A,74.00,E

In [18]:
# Concatenate class list ab and cd as final

# Concat class lists a and b

classlist= pd.concat([classlist_ab, classlist_cd])

# View the DataFrame. 
print((classlist.shape))
classlist

(675, 5)

,Student number,Surname,Initials,Final mark,Class
0,15476227,AFONSO,L,47.72,E
1,15311279,ALBERTYN,F J H,57.52,A
2,15637913,ALEXANDER,L,90.68,E
3,15124150,BAM,A J,56.43,E
4,15829626,BARROW,S B,79.64,E
...,...,...,...,...,...
214,16443144,WIJERS,MC,93.00,E
215,14955849,WIJNBERG,JM,47.00,E
216,17140293,WILLIAMS,CA,43.00,A
217,16771354,WOLHUTER,J,76.00,E
218,17094607,ZINN,A,74.00,E

# 3.1.3 -Combining data sets with merge()

In [19]:
# Create the Cars Models DataFrame

# Create a DataFrame.
cars_3 = pd.DataFrame({'VW': ['Polo', 'T-Cross', 'Tiguan', 'Toureg'],
                       'Toyota': ['Agya', 'Corolla', 'Rav4', 'Land Cruiser'],
                       'Honda': ['Brio', 'Jazz', 'HRV', 'CRV'], 
                       'BMW': ['BMW1', 'BMW2', 'BMW3', 'BMW4']}, 
                      index=[0, 1, 2, 3])

# View the DataFrame.
cars_3

        VW        Toyota Honda   BMW
0     Polo          Agya  Brio  BMW1
1  T-Cross       Corolla  Jazz  BMW2
2   Tiguan          Rav4   HRV  BMW3
3   Toureg  Land Cruiser   CRV  BMW4

In [20]:
# Create the motorcycle models DataFrame
# Create a DataFrame.
motorcycles_3 = pd.DataFrame({'VW': ['-', '-', '-', '-'],
                              'Toyota': ['-', '-', '-', '-'],
                              'Honda': ['Shine', 'Activa',
                                        'Comfort Travel',
                                        'Adventure Sport'], 
                              'BMW': ['Sport', 'Roadster',
                                      'Heritage', 'Adventure']}, 
                             index=[0, 1, 2, 3])

# View the DataFrame.
motorcycles_3

  VW Toyota            Honda        BMW
0  -      -            Shine      Sport
1  -      -           Activa   Roadster
2  -      -   Comfort Travel   Heritage
3  -      -  Adventure Sport  Adventure

In [24]:
# Merge the two DataFrames

# Merge the DataFrames.
products_3 = pd.merge(cars_3, motorcycles_3)

# View the DataFrame.
products_3

Empty DataFrame
Columns: [VW, Toyota, Honda, BMW]
Index: []

# 3.1.6 - The groupby() function

# GroupBy syntax 

df.groupby(
    by='None', 
    axis= 0, 
    level='None', 
    as_index='True', 
    sort='True', 
    group_keys='True', 
    squeeze='False')

In [25]:
"""The splitting criteria are sometimes called groupby mapping. 
This refers to the abstract definition of grouping, which is to provide a mapping of labels to group names. 
You can specify splitting criteria in many different ways, for example:

a Python function called on each axis label (rows when axis=0 and columns when axis=1)
for DataFrame objects, a string indicating a column or list of column names for grouping
a list or NumPy array of the same length as the selected axis
a dictionary or series that provides a label for group name mapping."""

'The splitting criteria are sometimes called groupby mapping. \nThis refers to the abstract definition of grouping, which is to provide a mapping of labels to group names. \nYou can specify splitting criteria in many different ways, for example:\n\na Python function called on each axis label (rows when axis=0 and columns when axis=1)\nfor DataFrame objects, a string indicating a column or list of column names for grouping\na list or NumPy array of the same length as the selected axis\na dictionary or series that provides a label for group name mapping.'

In [27]:
# Apply the split-apply-combine method

classlist_a = pd.read_csv('classlist_a.csv')
classlist_b = pd.read_csv('classlist_b.csv')
classlist_c = pd.read_csv('classlist_c.csv')
classlist_d = pd.read_csv('classlist_d.csv')

print(classlist_a.shape)
print(classlist_b.shape)
print(classlist_c.shape)
print(classlist_d.shape)

(145, 5)
(126, 5)
(185, 5)
(219, 5)

In [30]:
classlist_final = pd.concat([classlist_a, classlist_b, classlist_c, classlist_d])

classlist_final.shape

(675, 5)

In [33]:
group_surname = classlist_final.groupby('Surname')

group_surname

In [34]:
group_marks = classlist_final.groupby('Final mark')

group_marks

In [36]:
group_surname_marks =classlist_final.groupby(['Surname', 'Final mark'])

group_surname_marks

In [37]:
# Sum method into groupby()

group_surname_marks.sum()

/var/folders/cn/47qy272s11q7_n4t9zj37np40000gn/T/ipykernel_1403/2456167051.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group_surname_marks.sum()

                                           Student number
Surname                        Final mark
ABRAHAMS                       48.00             15793648
ACKERMANN                      45.00             17483638
ADENDORFF                      76.50             15849376
AFONSO                         47.72             15476227
ALBERTUS                       57.00             16564499
...                                                   ...
YOUNG                          88.05             15849390
ZINN                           74.00             17094607
ZONDAGH                        59.10             15897184
ZONDI                          74.46             16324773
ZUMA                           64.50             16782879

[673 rows x 1 columns]

In [38]:
group_surname_marks.size()

Surname                         Final mark
ABRAHAMS                        48.00         1
ACKERMANN                       45.00         1
ADENDORFF                       76.50         1
AFONSO                          47.72         1
ALBERTUS                        57.00         1
                                             ..
YOUNG                           88.05         1
ZINN                            74.00         1
ZONDAGH                         59.10         1
ZONDI                           74.46         1
ZUMA                            64.50         1
Length: 673, dtype: int64

In [39]:
group_surname.size()

Surname
ABRAHAMS                          1
ACKERMANN                         1
ADENDORFF                         1
AFONSO                            1
ALBERTUS                          1
                                 ..
YOUNG                             1
ZINN                              1
ZONDAGH                           1
ZONDI                             1
ZUMA                              1
Length: 534, dtype: int64

In [40]:
group_initials = classlist_final.groupby('Initials')

group_surname_initials = classlist_final.groupby(['Surname', 'Initials'])

group_surname_initials.size()

Surname                         Initials
ABRAHAMS                        B             1
ACKERMANN                       E             1
ADENDORFF                       K             1
AFONSO                          L             1
ALBERTUS                        S             1
                                             ..
YOUNG                           V A           1
ZINN                            A             1
ZONDAGH                         L             1
ZONDI                           WP            1
ZUMA                            MC            1
Length: 666, dtype: int64

In [41]:
group_surname_initials.count()

                                           Student number  Final mark  Class
Surname                        Initials
ABRAHAMS                       B                        1           1      1
ACKERMANN                      E                        1           1      1
ADENDORFF                      K                        1           1      1
AFONSO                         L                        1           1      1
ALBERTUS                       S                        1           1      1
...                                                   ...         ...    ...
YOUNG                          V A                      1           1      1
ZINN                           A                        1           1      1
ZONDAGH                        L                        1           1      1
ZONDI                          WP                       1           1      1
ZUMA                           MC                       1           1      1

[666 rows x 3 columns]

In [42]:
group_initials = classlist_final.groupby('Initials')

group_surname_initials = classlist_final.groupby(['Surname', 'Initials'])

group_surname_initials.size()

Surname                         Initials
ABRAHAMS                        B             1
ACKERMANN                       E             1
ADENDORFF                       K             1
AFONSO                          L             1
ALBERTUS                        S             1
                                             ..
YOUNG                           V A           1
ZINN                            A             1
ZONDAGH                         L             1
ZONDI                           WP            1
ZUMA                            MC            1
Length: 666, dtype: int64

# 3.2.1 - Map function()

Application of the map() function
Prof. Minnaar added another column to the class lists. Each of the four class lists now has five columns (Student number, Surname, Initials, Final mark and Class). The Class column represents the building in which the lectures are taking place (A for Annex and E for Exhibition Hall).

Follow the demonstration video to help Prof. Minnaar in her search for answers. Most of the code snippets will seem familiar to you. This is part of the process to understand that Python code snippets should not be used in silos, but rather weaved into the storytelling.

Prof. Minnaar needs to transform the class list according to the University's database. Therefore, she has two requests:

She wants the Class column to be changed from a string to an integer. For example, the A and E should be replaced with 1 and 0. 
The column Final mark needs to be renamed to Final_mark.

In [6]:

classlist_a = pd.read_csv('classlist_a.csv')
classlist_b = pd.read_csv('classlist_b.csv')
classlist_c = pd.read_csv('classlist_c.csv')
classlist_d = pd.read_csv('classlist_d.csv')

classlist = pd.concat([classlist_a, classlist_b, classlist_c, classlist_d])
classlist

,Student number,Surname,Initials,Final mark,Class
0,15476227,AFONSO,L,47.72,E
1,15311279,ALBERTYN,F J H,57.52,A
2,15637913,ALEXANDER,L,90.68,E
3,15124150,BAM,A J,56.43,E
4,15829626,BARROW,S B,79.64,E
...,...,...,...,...,...
214,16443144,WIJERS,MC,93.00,E
215,14955849,WIJNBERG,JM,47.00,E
216,17140293,WILLIAMS,CA,43.00,A
217,16771354,WOLHUTER,J,76.00,E
218,17094607,ZINN,A,74.00,E

In [7]:
print(classlist.shape)
print(classlist.columns)
print(classlist.dtypes)

(675, 5)
Index(['Student number', 'Surname', 'Initials', 'Final mark', 'Class'], dtype='object')
Student number      int64
Surname            object
Initials           object
Final mark        float64
Class              object
dtype: object

In [9]:
# applying map function

classlist['Class_num'] = classlist.Class.map({'A':0, 'E':1})

print(classlist.shape)
classlist.head()

(675, 6)

   Student number    Surname Initials  Final mark Class  Class_num
0        15476227     AFONSO        L       47.72     E          1
1        15311279   ALBERTYN    F J H       57.52     A          0
2        15637913  ALEXANDER        L       90.68     E          1
3        15124150        BAM      A J       56.43     E          1
4        15829626     BARROW      S B       79.64     E          1

In [11]:
# compare the two class functions using loc or iloc functions

print(classlist.loc[:,['Class', 'Class_num']])

classlist.iloc[:, 4:6]

    Class  Class_num
0       E          1
1       A          0
2       E          1
3       E          1
4       E          1
..    ...        ...
214     E          1
215     E          1
216     A          0
217     E          1
218     E          1

[675 rows x 2 columns]

    Class  Class_num
0       E          1
1       A          0
2       E          1
3       E          1
4       E          1
..    ...        ...
214     E          1
215     E          1
216     A          0
217     E          1
218     E          1

[675 rows x 2 columns]

In [18]:
# Change the name of the column

classlist_final = classlist.rename(columns={'Final mark':'Final_mark'})

classlist_final.head()

   Student number    Surname Initials  Final_mark Class  Class_num
0        15476227     AFONSO        L       47.72     E          1
1        15311279   ALBERTYN    F J H       57.52     A          0
2        15637913  ALEXANDER        L       90.68     E          1
3        15124150        BAM      A J       56.43     E          1
4        15829626     BARROW      S B       79.64     E          1

In [19]:
# Determine the average of Final_mark for the whole class list.
classlist_final['Final_mark'].mean()

60.13431111111112

# Case study example

Apply your learning
The apply() method allows us to ‘apply’ a function to the rows or columns of a DataFrame. Arjun, an intern data analyst, is still assisting Mr Zachariou. Mr Zachariou asked Arjun to determine the average product price and sales quantity for transactions in 2010. Let’s investigate!

In [20]:
# Import the libraries.
import pandas as pd
import numpy as np

# Read the CSV file from the current working directory.
transactions_2010 = pd.read_csv('transactions_2010.csv')

# View DataFrame.
print(transactions_2010.shape)

# Calculate the mean quantity and price.
transactions_2010[['Quantity', 'UnitPrice']].apply(np.mean)

(26850, 6)

Quantity     11.037691
UnitPrice     3.205109
dtype: float64

# Challenge!
Try to answer the following question.

Which year (2010 or 2011) was better for Mr Zachariou in terms of the number of products sold? (Hint: Calculate the average product price and sales quantity for transactions in 2011 as you did for 2010.)

In [21]:
# Read the CSV file from the current working directory.
transactions_2011 = pd.read_csv('transactions_2011.csv')

# View DataFrame.
print(transactions_2011.shape)

(379979, 6)

In [22]:
# Calculate the mean quantity and price.
transactions_2011[['Quantity', 'UnitPrice']].apply(np.mean)

Quantity     12.133634
UnitPrice     3.478515
dtype: float64

# 3.2.3 - applymap function

In [23]:
# Using imported file from website 

drinks = pd.read_csv('http://bit.ly/drinksbycountry')

print(drinks.shape)
print(drinks.dtypes)

(193, 6)
country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [25]:
# change the integers to floats

drinks_new = drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float)

# view the changes in new DataFrame
drinks_new.head()

   beer_servings  spirit_servings  wine_servings
0            0.0              0.0            0.0
1           89.0            132.0           54.0
2           25.0              0.0           14.0
3          245.0            138.0          312.0
4          217.0             57.0           45.0

In [27]:
print(drinks_new.info)

<bound method DataFrame.info of      beer_servings  spirit_servings  wine_servings
0              0.0              0.0            0.0
1             89.0            132.0           54.0
2             25.0              0.0           14.0
3            245.0            138.0          312.0
4            217.0             57.0           45.0
..             ...              ...            ...
188          333.0            100.0            3.0
189          111.0              2.0            1.0
190            6.0              0.0            0.0
191           32.0             19.0            4.0
192           64.0             18.0            4.0

[193 rows x 3 columns]>

# Case study

Mr Zachariou from the All-You-Need case study, wants you to determine the total number of characters the StockCodes and Descriptions columns have. Let's see how the applymap() function can help to answer the question.

In [29]:
# Read the CSV file from the current working directory.
products = pd.read_csv('products.csv')

# View the DataFrame.
print(products.shape)

(3945, 2)

In [32]:
# Determine the number of characters.
number_of_chars = products.applymap(len)\
.rename(columns={'StockCode': 'LenStockCode', 'Description': 'LenDescription'})

# View the output.
number_of_chars.head()

   LenStockCode  LenDescription
0             5              26
1             5              24
2             5              12
3             6              20
4             6              27

In [33]:
# Alternative way to present the previous code snippet

# Concatenate the columns, sort by the length of the product description.
pd.concat([products, number_of_chars], axis=1).sort_values('LenDescription')

,StockCode,Description,LenStockCode,LenDescription
148,20681,MIA,5,3
1609,22734,FOUND,5,5
3944,m,Manual,1,6
3935,M,Manual,1,6
3938,S,SAMPLES,1,7
...,...,...,...,...
3624,90038B,GLASS AND PAINTED BEADS BRACELET OL,6,35
3623,90038A,GLASS AND PAINTED BEADS BRACELET TO,6,35
3619,90036F,"FLOWER GLASS GARLD NECKL36""TURQUOIS",6,35
3617,90036D,"FLOWER GLASS GARLAND NECKL.36""BLACK",6,35
2101,23243,SET OF TEA COFFEE SUGAR TINS PANTRY,5,35

# 3.2.5 - Writing a user-defined function

In [36]:
def calculator(a,b):
    print('Addition:', a+b)
    print('Subtraction:', a-b,)
    print('Multiplication:', a*b)
    print('Division:', a/b)
    return; 

# Using an example 
calculator(12,10)

Addition: 22
Subtraction: 2
Multiplication: 120
Division: 1.2

In [37]:
# Further practive of user-defined functions

# Write a user-defined function.
def f(x):
    y = (x * 2) + 10
    return y

# Stipulate what to calculate.
f(x=3)

16

# Apply your learning
Let’s recap what you’ve learned in the video with a real-life example. To make it more interesting, we’ll incorporate the apply() and applymap() functions. In real-life scenarios, these two functions are used in conjunction with user-defined function(s). It allows you to deal with more complex tasks in data analysis such as string manipulation or recoding data to multiple levels.

We will continue with the All-You-Need case study. Mr Zachariou already asked Arjun to perform more data wrangling. Mr Zachariou wants to know how many of the products in his store contain the word ‘glass’ in the description. He may be able to reapply for insurance with a lower premium if many of the items contain glass. Arjun decides to write a user-defined function and utilise the products.csv data set, available in the Data folder of the ZIP file you downloaded in 3.0 Focus of the module.

In [38]:
# Import Pandas.
import pandas as pd

# Read the CSV file from the current working directory.
products = pd.read_csv('products.csv')

# View the DataFrame.
products.shape

(3945, 2)

# Which products contain the word ‘glass’ in the description?

In [39]:
# Create a user-defined function.
def contains_glass(x):
    """ does the product contain glass? """
    y = x.lower()
    return "glass" in y

# View the output.
print(contains_glass(x="Glass bottle"))
print(contains_glass(x="glass bottle"))
print(contains_glass(x="bottle"))

True
True
False

# Explanation and context 

The first two print() functions do contain the word glass. Your user-defined function is working.

Let’s test your user-defined function on the whole Description column. Because we're only using the Description column, Python will consider it a Pandas Series. This is important because it has an impact on your code snippet. Follow these prompts:

Create a new Series to display the output as fc.
Specify the column name to be used as the Series (products["Description"]).
Add the apply() function and specify the function_name of the user-defined function (contains_glass). This will ensure that your user-defined function is now applied to the Series you specified.
View the Series.
Filter the result to only indicate the number of rows containing the word glass.
Specify the Series you want to apply the filter on (products[fc]).

In [42]:
# Use the apply() function. 

fc = products['Description'].apply(contains_glass)

# view the DataFrame
print(fc)

products[fc]

0       False
1       False
2       False
3       False
4       False
        ...
3940    False
3941    False
3942    False
3943    False
3944    False
Name: Description, Length: 3945, dtype: bool

     StockCode                    Description
106     17129F         BLUE GLASS GEMS IN BAG
220      20798          CLEAR MILKSHAKE GLASS
221      20801   LARGE PINK GLASS SUNDAE DISH
222      20802  SMALL GLASS SUNDAE DISH CLEAR
223      20803   SMALL PINK GLASS SUNDAE DISH
...        ...                            ...
3866    90199D  5 STRAND GLASS NECKLACE AMBER
3886    90209A  PURPLE ENAMEL+GLASS HAIR COMB
3887    90209B   GREEN ENAMEL+GLASS HAIR COMB
3888    90209C    PINK ENAMEL+GLASS HAIR COMB
3927  DCGS0003            BOXED GLASS ASHTRAY

[171 rows x 2 columns]

# 3.2.7 - lambda functions

In [47]:
# Basic lambda example

example = lambda x: x*2
example(10)

20

In [48]:
# Basic lambda example: multiple arguments.
example_2 = lambda x, y, z: x * 2 + y - z

example_2(5, 10, 15)

5

In [49]:
# lambda function and filter functions 

# Create a list.
sequence = [10, 2, 8, 7, 5, 4, 3, 11, 0, 1]

# Lambda and filter function.
filter_answer = filter (lambda x: x > 6, sequence) 

list(filter_answer)

[10, 8, 7, 11]

In [50]:
# lambda() function and map() functions 

# Create a list.
sequence_2 = [10, 2, 8, 7, 5, 4, 11]

# Lambda and map function.
squared_result = map (lambda x: x*x, sequence_2)

list(squared_result)

[100, 4, 64, 49, 25, 16, 121]

In [52]:
# lambda function: combine values

"""You can use the lambda function to perform data wrangling while combining the first and last names. 
The code snippet can be written as:

#Name the lambda function (optional part of code snippet), for example, full_name.
#Specify the lambda parameters as first name and last name (fn, ln). 
(Hint: You can employ placeholders that make contextual sense, but are flexible.)

#Specify the expression as:
take the first name (fn), remove any spaces with the strip() function, 
and use the title case by employing the title() function. For example fn.strip().title().
take the last name ln(), remove any spaces with the strip() function, and use the title 
case by employing the title() function. For example ln.strip().title().

#Instruct Python to execute the function by specifying the arguments fn, ln equal to ("    vincent", "  van gogh"). 
#Add a few spaces to make it more challenging."""

# Combine two values into one with lambda.
full_name = lambda fn, ln: fn.strip().title() + " " + ln.strip().title()

full_name("    vincent", "  van gogh")

'Vincent Van Gogh'